------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/bianca/Dropbox/_AcademicWork/Active/Research/-underReview/MLS_MatchingLabelingStig
> ma/work_socius_2024_09_corrected/mls-data08-contact_valence.log
  log type:  text
 opened on:  26 Sep 2024, 16:59:47

.  
.  
. **********
. /// #0 Setup    
> **********      
.  
.  version 17.0

.  set linesize 80

.  clear all

.  macro drop _all

.  set matsize 100, perm
(set matsize preference recorded)
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix
    sizes are now limited by edition of Stata.  See limits for more details.

. 
.  
.  local pgm   mls-data08-contact_valence.do

.  local dte   2024-09-25 

.  local who   bianca manago

.  local tag   "`pgm'.do `who' `dte'"

.  
.  di "`tag'"
mls-data08-contact_valence.do.do bianca manago 2024-09-25

.  
. ****************************************************************
.  // #1 Load Data
. ****************************************************************        
.         
. use "Data/mls-data06-scales", clear     

. 
. ****************************************************************
. // #2
. ****************************************************************
. 
. /* 
> Didn't need these variables in the main dataset. Re-doing all of the
> bootstrapping takes hours, so we created a subset of the data for these
> analyses for Appendix C.
> */
. 
.         sum myprobs*                    

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    myprobs1 |        593    3.313659    2.901438          1         10
    myprobs2 |        358    3.094972    2.683475          1         10
    myprobs3 |        247    2.724696    2.285763          1         10
    myprobs4 |        148    2.709459    2.365435          1         10
    myprobs5 |         95    2.810526    2.472378          1         10

.         
.         egen myprob_max = rowmax(myprobs*)
(3,460 missing values generated)

.         egen myprob_avg = rowmean(myprobs*)
(3,460 missing values generated)

.         
.         sum myprob*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    myprobs1 |        593    3.313659    2.901438          1         10
    myprobs2 |        358    3.094972    2.683475          1         10
    myprobs3 |        247    2.724696    2.285763          1         10
    myprobs4 |        148    2.709459    2.365435          1         10
    myprobs5 |         95    2.810526    2.472378          1         10
-------------+---------------------------------------------------------
  myprob_max |        594    4.181818     3.07258          1         10
  myprob_avg |        594     3.07514    2.364985          1         10

.         
.         recode myprob_max (1=0 "None") (1.000001/10=1 "Some"), gen(c_effect_an
> y)
(594 differences between myprob_max and c_effect_any)

.         
.         la var c_effect_any "Any distress from any friends with MH"

.         
.         recode myprob_max (0/4.181818=0 "Low") ///
>                           (4.181819/10=1 "High"), gen(c_effect_gtmaxavg)
(594 differences between myprob_max and c_effect_gtmaxavg)

.                                           
.         la var c_effect_gtmaxavg "GT max avg distress from friends with MH"   
>                             

.         
.         recode myprob_avg (0/3.07514=0 "Low") ///
>                           (3.07515/10=1 "High"), gen(c_effect_gtavg)
(594 differences between myprob_avg and c_effect_gtavg)

.                                           
.         la var c_effect_gtavg "GT avg distress from friends with MH"          
>                             

.                                           
.         fre c_effect_any

c_effect_any -- Any distress from any friends with MH
-------------------------------------------------------------
                |      Freq.    Percent      Valid       Cum.
----------------+--------------------------------------------
Valid   0  None |        188       4.64      31.65      31.65
        1  Some |        406      10.01      68.35     100.00
        Total   |        594      14.65     100.00           
Missing .i      |       3460      85.35                      
Total           |       4054     100.00                      
-------------------------------------------------------------

.         fre c_effect_gtmaxavg

c_effect_gtmaxavg -- GT max avg distress from friends with MH
-------------------------------------------------------------
                |      Freq.    Percent      Valid       Cum.
----------------+--------------------------------------------
Valid   0  Low  |        342       8.44      57.58      57.58
        1  High |        252       6.22      42.42     100.00
        Total   |        594      14.65     100.00           
Missing .i      |       3460      85.35                      
Total           |       4054     100.00                      
-------------------------------------------------------------

.         fre c_effect_gtavg

c_effect_gtavg -- GT avg distress from friends with MH
------------------------------------------------------------
               |      Freq.    Percent      Valid       Cum.
---------------+--------------------------------------------
Valid   0 Low  |        388       9.57      65.32      65.32
        1 High |        206       5.08      34.68     100.00
        Total  |        594      14.65     100.00           
Missing .      |       3460      85.35                      
Total          |       4054     100.00                      
------------------------------------------------------------

.         
.         tab c_effect_gtavg c_effect_gtmaxavg, cell

+-----------------+
| Key             |
|-----------------|
|    frequency    |
| cell percentage |
+-----------------+

    GT avg |
  distress |
      from |  GT max avg distress
   friends | from friends with MH
   with MH |       Low       High |     Total
-----------+----------------------+----------
       Low |       334         54 |       388 
           |     56.23       9.09 |     65.32 
-----------+----------------------+----------
      High |         8        198 |       206 
           |      1.35      33.33 |     34.68 
-----------+----------------------+----------
     Total |       342        252 |       594 
           |     57.58      42.42 |    100.00 

.         
.         
.         la var c_effectR "Relationship Consequences of MI"

.         
.         fre c_*

c_brkddur -- duration, severity of nervous breakdown feelings 
------------------------------------------------------------
               |      Freq.    Percent      Valid       Cum.
---------------+--------------------------------------------
Valid   1      |         87       2.15      41.23      41.23
        2      |          1       0.02       0.47      41.71
        3      |         18       0.44       8.53      50.24
        4      |         16       0.39       7.58      57.82
        5      |         20       0.49       9.48      67.30
        6      |          5       0.12       2.37      69.67
        7      |         51       1.26      24.17      93.84
        8      |         13       0.32       6.16     100.00
        Total  |        211       5.20     100.00           
Missing .i IAP |       3667      90.45                      
        .n NA  |        176       4.34                      
        Total  |       3843      94.80                      
Total          |       4054     100.00                      
------------------------------------------------------------

c_brkdlong -- Length Breakdown 1=Long
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |        105       2.59      49.76      49.76
        1     |        106       2.61      50.24     100.00
        Total |        211       5.20     100.00           
Missing .i    |       3667      90.45                      
        .n    |        176       4.34                      
        Total |       3843      94.80                      
Total         |       4054     100.00                      
-----------------------------------------------------------

c_brkdsev -- Severity Breakdown 1=severe
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |       1290      31.82      89.34      89.34
        1     |        154       3.80      10.66     100.00
        Total |       1444      35.62     100.00           
Missing .     |       2610      64.38                      
Total         |       4054     100.00                      
-----------------------------------------------------------

c_diagnosd -- r ever diagnosed with mh problem
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1  yes        |        197       4.86      17.39      17.39
        2  no         |        936      23.09      82.61     100.00
        Total         |       1133      27.95     100.00           
Missing .d Don't know |          5       0.12                      
        .i IAP        |       2881      71.07                      
        .n No answer  |         35       0.86                      
        Total         |       2921      72.05                      
Total                 |       4054     100.00                      
-------------------------------------------------------------------

c_effectR -- Relationship Consequences of MI
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0  No Contact |        522      12.88      36.66      36.66
        1  Stronger   |        237       5.85      16.64      53.30
        2  No Change  |        463      11.42      32.51      85.81
        3  Worse      |        202       4.98      14.19     100.00
        Total         |       1424      35.13     100.00           
Missing .n            |         13       0.32                      
        .y            |       2617      64.55                      
        Total         |       2630      64.87                      
Total                 |       4054     100.00                      
-------------------------------------------------------------------

c_effectY -- Personal Distress from Contact
---------------------------------------------------------------------
                        |      Freq.    Percent      Valid       Cum.
------------------------+--------------------------------------------
Valid   0  No Contact   |        522      12.88      36.71      36.71
        1  Not at all   |        200       4.93      14.06      50.77
        2  A little     |        281       6.93      19.76      70.53
        3  Quite a bit  |        179       4.42      12.59      83.12
        4  A great deal |        240       5.92      16.88     100.00
        Total           |       1422      35.08     100.00           
Missing .d              |          1       0.02                      
        .n              |         14       0.35                      
        .y              |       2617      64.55                      
        Total           |       2632      64.92                      
Total                   |       4054     100.00                      
---------------------------------------------------------------------

c_evbrkdwn -- ever felt going to have a nervous breakdown?
------------------------------------------------------------------
                     |      Freq.    Percent      Valid       Cum.
---------------------+--------------------------------------------
Valid   1  yes       |        376       9.27      26.42      26.42
        2  no        |       1047      25.83      73.58     100.00
        Total        |       1423      35.10     100.00           
Missing .d DONT KNOW |         10       0.25                      
        .i IAP       |       2610      64.38                      
        .n NA        |         11       0.27                      
        Total        |       2631      64.90                      
Total                |       4054     100.00                      
------------------------------------------------------------------

c_evmhp -- ever had mental health problem 
-----------------------------------------------------------------
                    |      Freq.    Percent      Valid       Cum.
--------------------+--------------------------------------------
Valid   1  yes      |         76       1.87       7.22       7.22
        2  no       |        977      24.10      92.78     100.00
        Total       |       1053      25.97     100.00           
Missing .a NA       |         13       0.32                      
        .i IAP      |       2987      73.68                      
        .n NOT SURE |          1       0.02                      
        Total       |       3001      74.03                      
Total               |       4054     100.00                      
-----------------------------------------------------------------

c_knwmhosp -- know anyone who was in a hospital 
-----------------------------------------------------------------
                    |      Freq.    Percent      Valid       Cum.
--------------------+--------------------------------------------
Valid   1  yes      |        366       9.03      50.76      50.76
        2  no       |        355       8.76      49.24     100.00
        Total       |        721      17.78     100.00           
Missing .a NA       |          7       0.17                      
        .i IAP      |       3318      81.85                      
        .n NOT SURE |          8       0.20                      
        Total       |       3333      82.22                      
Total               |       4054     100.00                      
-----------------------------------------------------------------

c_knwpatnt -- known anyone seeing a psychologist etc? 
------------------------------------------------------------------
                     |      Freq.    Percent      Valid       Cum.
---------------------+--------------------------------------------
Valid   1  yes       |        388       9.57      58.88      58.88
        2  no        |        271       6.68      41.12     100.00
        Total        |        659      16.26     100.00           
Missing .d DONT KNOW |         11       0.27                      
        .i IAP       |       3318      81.85                      
        .n NA        |         66       1.63                      
        Total        |       3395      83.74                      
Total                |       4054     100.00                      
------------------------------------------------------------------

c_mhdiagno -- r knows someone who has been diagnosed with a mental health proble
> m
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   1  yes        |        597      14.73      52.83      52.83
        2  no         |        533      13.15      47.17     100.00
        Total         |       1130      27.87     100.00           
Missing .d Don't know |          6       0.15                      
        .i IAP        |       2881      71.07                      
        .n No answer  |         37       0.91                      
        Total         |       2924      72.13                      
Total                 |       4054     100.00                      
-------------------------------------------------------------------

c_mhothrel -- result of mental health problem to relationship with him 
-----------------------------------------------------------------------------
                                |      Freq.    Percent      Valid       Cum.
--------------------------------+--------------------------------------------
Valid   1  became stronger      |        237       5.85      26.45      26.45
        2  became worse         |        125       3.08      13.95      40.40
        3  was unchanged        |        457      11.27      51.00      91.41
        4  ended as a result of |         77       1.90       8.59     100.00
           the problem          |                                            
        Total                   |        896      22.10     100.00           
Missing .d DONT KNOW            |          6       0.15                      
        .i IAP                  |       3139      77.43                      
        .n NO ANSWER            |         13       0.32                      
        Total                   |       3158      77.90                      
Total                           |       4054     100.00                      
-----------------------------------------------------------------------------

c_mhothyou -- how much distress his mental health problem caused r
---------------------------------------------------------------------
                        |      Freq.    Percent      Valid       Cum.
------------------------+--------------------------------------------
Valid   1  a great deal |        240       5.92      26.67      26.67
        2  quite a bit  |        179       4.42      19.89      46.56
        3  a little     |        281       6.93      31.22      77.78
        4  not at all   |        200       4.93      22.22     100.00
        Total           |        900      22.20     100.00           
Missing .d DONT KNOW    |          1       0.02                      
        .i IAP          |       3139      77.43                      
        .n NO ANSWER    |         14       0.35                      
        Total           |       3154      77.80                      
Total                   |       4054     100.00                      
---------------------------------------------------------------------

c_mhtreatd -- r ever treated for mh problem
------------------------------------------------------------------
                     |      Freq.    Percent      Valid       Cum.
---------------------+--------------------------------------------
Valid   1  yes       |        187       4.61      94.92      94.92
        2  no        |         10       0.25       5.08     100.00
        Total        |        197       4.86     100.00           
Missing .i IAP       |       3822      94.28                      
        .n No answer |         35       0.86                      
        Total        |       3857      95.14                      
Total                |       4054     100.00                      
------------------------------------------------------------------

c_mhtrtot2 -- r knows someone who received treatment for mental health
------------------------------------------------------------
               |      Freq.    Percent      Valid       Cum.
---------------+--------------------------------------------
Missing .i IAP |       4054     100.00                      
------------------------------------------------------------

c_mhtrtoth -- r personally has known someone who received treatment
------------------------------------------------------------------
                     |      Freq.    Percent      Valid       Cum.
---------------------+--------------------------------------------
Valid   1  yes       |        902      22.25      63.84      63.84
        2  no        |        511      12.60      36.16     100.00
        Total        |       1413      34.85     100.00           
Missing .d DONT KNOW |         11       0.27                      
        .i IAP       |       2617      64.55                      
        .n NO ANSWER |         13       0.32                      
        Total        |       2641      65.15                      
Total                |       4054     100.00                      
------------------------------------------------------------------

c_mhtrtslf -- r have ever personally received treatment for mental health proble
> m
------------------------------------------------------------
               |      Freq.    Percent      Valid       Cum.
---------------+--------------------------------------------
Missing .i IAP |       4054     100.00                      
------------------------------------------------------------

c_effect_any -- Any distress from any friends with MH
-------------------------------------------------------------
                |      Freq.    Percent      Valid       Cum.
----------------+--------------------------------------------
Valid   0  None |        188       4.64      31.65      31.65
        1  Some |        406      10.01      68.35     100.00
        Total   |        594      14.65     100.00           
Missing .i      |       3460      85.35                      
Total           |       4054     100.00                      
-------------------------------------------------------------

c_effect_gtmaxavg -- GT max avg distress from friends with MH
-------------------------------------------------------------
                |      Freq.    Percent      Valid       Cum.
----------------+--------------------------------------------
Valid   0  Low  |        342       8.44      57.58      57.58
        1  High |        252       6.22      42.42     100.00
        Total   |        594      14.65     100.00           
Missing .i      |       3460      85.35                      
Total           |       4054     100.00                      
-------------------------------------------------------------

c_effect_gtavg -- GT avg distress from friends with MH
------------------------------------------------------------
               |      Freq.    Percent      Valid       Cum.
---------------+--------------------------------------------
Valid   0 Low  |        388       9.57      65.32      65.32
        1 High |        206       5.08      34.68     100.00
        Total  |        594      14.65     100.00           
Missing .      |       3460      85.35                      
Total          |       4054     100.00                      
------------------------------------------------------------

.         
.         replace c_effectR=.y if year!=2006
(0 real changes made)

.         replace c_effectY=.y if year!=2006
(0 real changes made)

.         
.                                                   
.         replace c_effect_any=.y if year!=2018
(2,881 real changes made, 2,881 to missing)

.         replace c_effect_gtmaxavg=.y if year!=2018
(2,881 real changes made, 2,881 to missing)

.         replace c_effect_gtavg=.y if year!=2018
(2,881 real changes made, 2,881 to missing)

.         
.         // var for the valence of contact (only in 06 survey). Ccoding it as 
. *       bad contact if it caused distress and/or had neg relationship conseque
> nces
. 
. 
. lab def cv4lab 0"No Contact" 1"Any Contact" 2"Bad Contact" 3"Good Contact", re
> place

. 
. gen     cntct_val4_DER_max = cntct_tot
(251 missing values generated)

. lab var cntct_val4_DER_max "Contact with valence - max/avg 2018 measure"

. replace cntct_val4_DER_max = 3 if cntct_tot == 1 & year == 2006
(902 real changes made)

. replace cntct_val4_DER_max = 2 if c_effectY == 3 | c_effectY == 4
(419 real changes made)

. replace cntct_val4_DER_max = 2 if c_effectR == 3 
(49 real changes made)

. replace cntct_val4_DER_max = 2 if c_effect_gtmaxavg == 1 
(252 real changes made)

. replace cntct_val4_DER_max = 3 if c_effect_gtmaxavg == 0 
(342 real changes made)

. lab val cntct_val4_DER_max cv4lab

. fre     cntct_val4_DER_max

cntct_val4_DER_max -- Contact with valence - max/avg 2018 measure
--------------------------------------------------------------------
                       |      Freq.    Percent      Valid       Cum.
-----------------------+--------------------------------------------
Valid   0 No Contact   |       1649      40.68      43.36      43.36
        1 Any Contact  |        658      16.23      17.30      60.66
        2 Bad Contact  |        720      17.76      18.93      79.60
        3 Good Contact |        776      19.14      20.40     100.00
        Total          |       3803      93.81     100.00           
Missing .              |        251       6.19                      
Total                  |       4054     100.00                      
--------------------------------------------------------------------

. tab     cntct_val4_DER_max cntct_tot, miss

Contact with |
   valence - |
max/avg 2018 |    Contact: Self and/or Other
     measure | no contac  contact w          . |     Total
-------------+---------------------------------+----------
  No Contact |     1,649          0          0 |     1,649 
 Any Contact |         0        658          0 |       658 
 Bad Contact |         0        720          0 |       720 
Good Contact |         0        776          0 |       776 
           . |         0          0        251 |       251 
-------------+---------------------------------+----------
       Total |     1,649      2,154        251 |     4,054 

. 
. 
. gen     cntct_val4_D_max = cntct_tot
(251 missing values generated)

. lab var cntct_val4_D_max "Distress and Contact w/ valence - max/avg 2018 measu
> re"

. replace cntct_val4_D_max = 3 if cntct_tot == 1 & year == 2006
(902 real changes made)

. replace cntct_val4_D_max = 2 if c_effectY == 3 | c_effectY == 4
(419 real changes made)

. replace cntct_val4_D_max = 2 if c_effect_gtmaxavg == 1 
(252 real changes made)

. replace cntct_val4_D_max = 3 if c_effect_gtmaxavg == 0
(342 real changes made)

. lab val cntct_val4_D_max cv4lab

. fre     cntct_val4_D_max

cntct_val4_D_max -- Distress and Contact w/ valence - max/avg 2018 measure
--------------------------------------------------------------------
                       |      Freq.    Percent      Valid       Cum.
-----------------------+--------------------------------------------
Valid   0 No Contact   |       1649      40.68      43.36      43.36
        1 Any Contact  |        658      16.23      17.30      60.66
        2 Bad Contact  |        671      16.55      17.64      78.31
        3 Good Contact |        825      20.35      21.69     100.00
        Total          |       3803      93.81     100.00           
Missing .              |        251       6.19                      
Total                  |       4054     100.00                      
--------------------------------------------------------------------

. tab     cntct_val4_D_max cntct_tot, miss

Distress and |
  Contact w/ |
   valence - |
max/avg 2018 |    Contact: Self and/or Other
     measure | no contac  contact w          . |     Total
-------------+---------------------------------+----------
  No Contact |     1,649          0          0 |     1,649 
 Any Contact |         0        658          0 |       658 
 Bad Contact |         0        671          0 |       671 
Good Contact |         0        825          0 |       825 
           . |         0          0        251 |       251 
-------------+---------------------------------+----------
       Total |     1,649      2,154        251 |     4,054 

. 
. 
. gen     cntct_val4_DER_avg = cntct_tot
(251 missing values generated)

. lab var cntct_val4_DER_avg "Contact with valence - mean/avg 2018 measure"

. replace cntct_val4_DER_avg = 3 if cntct_tot == 1 & year == 2006
(902 real changes made)

. replace cntct_val4_DER_avg = 2 if c_effectY == 3 | c_effectY == 4
(419 real changes made)

. replace cntct_val4_DER_avg = 2 if c_effectR == 3 
(49 real changes made)

. replace cntct_val4_DER_avg = 2 if c_effect_gtavg == 1 
(206 real changes made)

. replace cntct_val4_DER_avg = 3 if c_effect_gtavg == 0
(388 real changes made)

. lab val cntct_val4_DER_avg cv4lab

. fre     cntct_val4_DER_avg

cntct_val4_DER_avg -- Contact with valence - mean/avg 2018 measure
--------------------------------------------------------------------
                       |      Freq.    Percent      Valid       Cum.
-----------------------+--------------------------------------------
Valid   0 No Contact   |       1649      40.68      43.36      43.36
        1 Any Contact  |        658      16.23      17.30      60.66
        2 Bad Contact  |        674      16.63      17.72      78.39
        3 Good Contact |        822      20.28      21.61     100.00
        Total          |       3803      93.81     100.00           
Missing .              |        251       6.19                      
Total                  |       4054     100.00                      
--------------------------------------------------------------------

. tab     cntct_val4_DER_avg cntct_tot, miss

Contact with |
   valence - |
    mean/avg |    Contact: Self and/or Other
2018 measure | no contac  contact w          . |     Total
-------------+---------------------------------+----------
  No Contact |     1,649          0          0 |     1,649 
 Any Contact |         0        658          0 |       658 
 Bad Contact |         0        674          0 |       674 
Good Contact |         0        822          0 |       822 
           . |         0          0        251 |       251 
-------------+---------------------------------+----------
       Total |     1,649      2,154        251 |     4,054 

. 
. 
. gen     cntct_val4_D_avg = cntct_tot
(251 missing values generated)

. lab var cntct_val4_D_avg "Distress and Contact w/ valence - mean/avg 2018 meas
> ure"

. replace cntct_val4_D_avg = 3 if cntct_tot == 1 & year == 2006
(902 real changes made)

. replace cntct_val4_D_avg = 2 if c_effectY == 3 | c_effectY == 4
(419 real changes made)

. replace cntct_val4_D_avg = 2 if c_effect_gtavg == 1 
(206 real changes made)

. replace cntct_val4_D_avg = 3 if c_effect_gtavg == 0 
(388 real changes made)

. lab val cntct_val4_D_avg cv4lab

. fre     cntct_val4_D_avg

cntct_val4_D_avg -- Distress and Contact w/ valence - mean/avg 2018 measure
--------------------------------------------------------------------
                       |      Freq.    Percent      Valid       Cum.
-----------------------+--------------------------------------------
Valid   0 No Contact   |       1649      40.68      43.36      43.36
        1 Any Contact  |        658      16.23      17.30      60.66
        2 Bad Contact  |        625      15.42      16.43      77.10
        3 Good Contact |        871      21.48      22.90     100.00
        Total          |       3803      93.81     100.00           
Missing .              |        251       6.19                      
Total                  |       4054     100.00                      
--------------------------------------------------------------------

. tab     cntct_val4_D_avg cntct_tot, miss

Distress and |
  Contact w/ |
   valence - |
    mean/avg |    Contact: Self and/or Other
2018 measure | no contac  contact w          . |     Total
-------------+---------------------------------+----------
  No Contact |     1,649          0          0 |     1,649 
 Any Contact |         0        658          0 |       658 
 Bad Contact |         0        625          0 |       625 
Good Contact |         0        871          0 |       871 
           . |         0          0        251 |       251 
-------------+---------------------------------+----------
       Total |     1,649      2,154        251 |     4,054 

. 
. ******
. // Drop for missing on DV
. ******
. count
  4,054

. local N `r(N)'

. drop if missing(socdistSS)
(133 observations deleted)

. local ndrop `r(N_drop)'

. di `ndrop'
133

. di              `ndrop'/`N' // 3.28% of sampled dropped
.0328071

. 
. 
. ******
. // Imputation
. ******
. 
. *MI impute won't impute the "soft missings" that are >.
. local miss "age degree L_mentlillB cntct_tot cntct_so4"  

. local miss "`miss' cntct_val4_DER_max cntct_val4_D_max"

. local miss "`miss' cntct_val4_DER_avg cntct_val4_D_avg"

. local miss "`miss' a_imbalnceR a_geneticsR a_stressesR a_wayraiseR a_charactrR
>  a_godswillR"

. foreach v in `miss' {
  2.         replace `v' = . if `v' >= .
  3.         }
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(105 real changes made, 105 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(164 real changes made, 164 to missing)
(120 real changes made, 120 to missing)
(51 real changes made, 51 to missing)
(99 real changes made, 99 to missing)
(73 real changes made, 73 to missing)
(92 real changes made, 92 to missing)

.         
. mi      set wide

. mi  register imputed    age degree L_mentlillB cntct_tot cntct_val4_DER_max cn
> tct_val4_D_max ///
>                                                 cntct_val4_DER_avg cntct_val4_
> D_avg coninc a_imbalnceR

. *                                               a_geneticsR a_stressesR a_wayr
> aiseR a_charactrR a_godswillR
. mi      register regular        female race region srcbelt wrkstat

. 
. *Trial run to see all is OK and how many imputations to make
.         
.         
. set seed 912663

. mi      impute chained ///
>         (pmm, knn(5)) age coninc ///    
>         (ologit) L_mentlillB degree ///
>         (logit,  omit(i.cntct_val4_DER_max i.cntct_val4_DER_avg i.cntct_val4_D
> _avg i.cntct_val4_D_max )) cntct_tot  ///
>         (mlogit, omit(i.cntct_tot i.cntct_val4_DER_avg i.cntct_val4_D_avg i.cn
> tct_val4_D_max)) cntct_val4_DER_max  ///
>         (mlogit, omit(i.cntct_tot i.cntct_val4_DER_max i.cntct_val4_D_avg i.cn
> tct_val4_D_max)) cntct_val4_DER_avg  ///
>         (mlogit, omit(i.cntct_tot i.cntct_val4_DER_avg i.cntct_val4_DER_max i.
> cntct_val4_D_avg)) cntct_val4_D_max  ///
>         (mlogit, omit(i.cntct_tot i.cntct_val4_DER_avg i.cntct_val4_DER_max i.
> cntct_val4_D_max)) cntct_val4_D_avg   ///
>         = female i.race i.region i.srcbelt i.wrkstat, ///
>         add(20) force augment dots rseed(912663)

Conditional models:
               age: pmm age i.degree i.L_mentlillB i.cntct_tot
                     i.cntct_val4_DER_max i.cntct_val4_DER_avg
                     i.cntct_val4_D_max i.cntct_val4_D_avg coninc female
                     i.race i.region i.srcbelt i.wrkstat , knn(5)
            degree: ologit degree age i.L_mentlillB i.cntct_tot
                     i.cntct_val4_DER_max i.cntct_val4_DER_avg
                     i.cntct_val4_D_max i.cntct_val4_D_avg coninc female
                     i.race i.region i.srcbelt i.wrkstat , augment
       L_mentlillB: ologit L_mentlillB age i.degree i.cntct_tot
                     i.cntct_val4_DER_max i.cntct_val4_DER_avg
                     i.cntct_val4_D_max i.cntct_val4_D_avg coninc female
                     i.race i.region i.srcbelt i.wrkstat , augment
         cntct_tot: logit cntct_tot age i.degree i.L_mentlillB coninc female
                     i.race i.region i.srcbelt i.wrkstat , augment
    cntct_va~R_max: mlogit cntct_val4_DER_max age i.degree i.L_mentlillB
                     coninc female i.race i.region i.srcbelt i.wrkstat ,
                     augment
    cntct_va~R_avg: mlogit cntct_val4_DER_avg age i.degree i.L_mentlillB
                     coninc female i.race i.region i.srcbelt i.wrkstat ,
                     augment
    cntct_va~D_max: mlogit cntct_val4_D_max age i.degree i.L_mentlillB coninc
                     female i.race i.region i.srcbelt i.wrkstat , augment
    cntct_va~D_avg: mlogit cntct_val4_D_avg age i.degree i.L_mentlillB coninc
                     female i.race i.region i.srcbelt i.wrkstat , augment
            coninc: pmm coninc age i.degree i.L_mentlillB i.cntct_tot
                     i.cntct_val4_DER_max i.cntct_val4_DER_avg
                     i.cntct_val4_D_max i.cntct_val4_D_avg female i.race
                     i.region i.srcbelt i.wrkstat , knn(5)

Performing chained iterations:
  imputing m=1 through m=20 xxxxxxxxxxxxxxxxxxxx done

Multivariate imputation                     Imputations =       20
Chained equations                                 added =       20
Imputed: m=1 through m=20                       updated =        0

Initialization: monotone                     Iterations =      200
                                                burn-in =       10

               age: predictive mean matching
            coninc: predictive mean matching
       L_mentlillB: ordered logistic regression
            degree: ordered logistic regression
         cntct_tot: logistic regression
    cntct_va~R_max: multinomial logistic regression
    cntct_va~R_avg: multinomial logistic regression
    cntct_va~D_max: multinomial logistic regression
    cntct_va~D_avg: multinomial logistic regression

------------------------------------------------------------------
                   |               Observations per m             
                   |----------------------------------------------
          Variable |   Complete   Incomplete   Imputed |     Total
-------------------+-----------------------------------+----------
               age |       3917            4         3 |      3921
            coninc |       3493          428       427 |      3921
       L_mentlillB |       3816          105       105 |      3921
            degree |       3917            4         4 |      3921
         cntct_tot |       3727          194       194 |      3921
    cntct_va~R_max |       3727          194       194 |      3921
    cntct_va~R_avg |       3727          194       194 |      3921
    cntct_va~D_max |       3727          194       194 |      3921
    cntct_va~D_avg |       3727          194       194 |      3921
------------------------------------------------------------------
(Complete + Incomplete = Total; Imputed is the minimum across m
 of the number of filled-in observations.)

Note: Right-hand-side variables (or weights) have missing values;
      model parameters estimated using listwise deletion.

. 
. 
. *Examine imputations (all look reasonable)
. foreach imp of numlist 1 20 {
  2.         fre     _`imp'_L_mentlillB                  if L_mentlillB == . 
  3.         fre     _`imp'_degree                       if degree == .      
  4. *       fre     _`imp'_a_imbalnceR                  if a_imbalnceR == .
.         fre     _`imp'_cntct_tot                    if cntct_tot == .   
  5.         fre     _`imp'_cntct_val4_DER_max       if cntct_val4_DER_max == . 
>      
  6.         fre     _`imp'_cntct_val4_DER_avg       if cntct_val4_DER_avg == . 
>      
  7.         fre     _`imp'_cntct_val4_D_max         if cntct_val4_D_max == .   
>      
  8.         fre     _`imp'_cntct_val4_D_avg     if cntct_val4_D_avg == .    
  9.         sum     _`imp'_age                                  if age == ., d
 10.         sum     _`imp'_coninc                       if coninc == ., d
 11.         }

_1_L_mentlillB
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         50      47.62      47.62      47.62
        1     |         55      52.38      52.38     100.00
        Total |        105     100.00     100.00           
-----------------------------------------------------------

_1_degree
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |          2      50.00      50.00      50.00
        2     |          1      25.00      25.00      75.00
        3     |          1      25.00      25.00     100.00
        Total |          4     100.00     100.00           
-----------------------------------------------------------

_1_cntct_tot
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         79      40.72      40.72      40.72
        1     |        115      59.28      59.28     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_1_cntct_val4_DER_max
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         75      38.66      38.66      38.66
        1     |         40      20.62      20.62      59.28
        2     |         40      20.62      20.62      79.90
        3     |         39      20.10      20.10     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_1_cntct_val4_DER_avg
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         86      44.33      44.33      44.33
        1     |         32      16.49      16.49      60.82
        2     |         27      13.92      13.92      74.74
        3     |         49      25.26      25.26     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_1_cntct_val4_D_max
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         88      45.36      45.36      45.36
        1     |         32      16.49      16.49      61.86
        2     |         26      13.40      13.40      75.26
        3     |         48      24.74      24.74     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_1_cntct_val4_D_avg
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         92      47.42      47.42      47.42
        1     |         36      18.56      18.56      65.98
        2     |         26      13.40      13.40      79.38
        3     |         40      20.62      20.62     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

                           _1_age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           31             31
 5%           31             32
10%           31             42       Obs                   3
25%           31              .       Sum of wgt.           3

50%           32                      Mean                 35
                        Largest       Std. dev.      6.082763
75%           42              .
90%           42             31       Variance             37
95%           42             32       Skewness       .6856675
99%           42             42       Kurtosis            1.5

                          _1_coninc
-------------------------------------------------------------
      Percentiles      Smallest
 1%         .441          .3505
 5%        3.969          .3505
10%      7.88625          .3505       Obs                 427
25%        15.43          .3505       Sum of wgt.         427

50%       31.545                      Mean           42.53835
                        Largest       Std. dev.      37.66744
75%       59.542        178.266
90%       88.211        178.266       Variance       1418.836
95%      121.461        178.266       Skewness       1.573112
99%      178.266        178.266       Kurtosis       5.506564

_20_L_mentlillB
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         41      39.05      39.05      39.05
        1     |         64      60.95      60.95     100.00
        Total |        105     100.00     100.00           
-----------------------------------------------------------

_20_degree
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |          2      50.00      50.00      50.00
        3     |          2      50.00      50.00     100.00
        Total |          4     100.00     100.00           
-----------------------------------------------------------

_20_cntct_tot
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         74      38.14      38.14      38.14
        1     |        120      61.86      61.86     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_20_cntct_val4_DER_max
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         83      42.78      42.78      42.78
        1     |         29      14.95      14.95      57.73
        2     |         40      20.62      20.62      78.35
        3     |         42      21.65      21.65     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_20_cntct_val4_DER_avg
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         77      39.69      39.69      39.69
        1     |         35      18.04      18.04      57.73
        2     |         31      15.98      15.98      73.71
        3     |         51      26.29      26.29     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_20_cntct_val4_D_max
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         77      39.69      39.69      39.69
        1     |         45      23.20      23.20      62.89
        2     |         23      11.86      11.86      74.74
        3     |         49      25.26      25.26     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

_20_cntct_val4_D_avg
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         78      40.21      40.21      40.21
        1     |         45      23.20      23.20      63.40
        2     |         31      15.98      15.98      79.38
        3     |         40      20.62      20.62     100.00
        Total |        194     100.00     100.00           
-----------------------------------------------------------

                           _20_age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           21             21
 5%           21             28
10%           21             29       Obs                   3
25%           21              .       Sum of wgt.           3

50%           28                      Mean                 26
                        Largest       Std. dev.      4.358899
75%           29              .
90%           29             21       Variance             19
95%           29             28       Skewness      -.6654689
99%           29             29       Kurtosis            1.5

                         _20_coninc
-------------------------------------------------------------
      Percentiles      Smallest
 1%         .561          .3505
 5%        3.087          .3505
10%        6.172          .3505       Obs                 427
25%        15.43           .441       Sum of wgt.         427

50%       31.545                      Mean           42.31848
                        Largest       Std. dev.      37.30387
75%      57.8325        178.266
90%        98.14        178.266       Variance       1391.579
95%      121.461        178.266       Skewness       1.536912
99%      178.266        178.266       Kurtosis       5.330847

. 
. list year id if _1_age >= .

      +------------+
      | year    id |
      |------------|
2683. | 2006   231 |
      +------------+

. drop if year == 2006 & id == 231        
(1 observation deleted)

.         
. *How many imputations? (based on von Hippel 2018)
. *       Need to first estimate model
. mi est: reg socdistSS   i.L_mentlillB i.year i.cntct_tot ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0086
                                                Largest FMI       =     0.1103
                                                Complete DF       =       3893
DF adjustment:   Small sample                   DF:     min       =   1,091.94
                                                        avg       =   3,674.62
                                                        max       =   3,889.10
Model F test:       Equal FMI                   F(  26, 3888.5)   =      40.39
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  L_mentlillB |
Lab MntlIl..  |    .069378     .02429     2.86   0.004     .0217501    .1170059
              |
         year |
        2006  |  -.0308533   .0256661    -1.20   0.229    -.0811737     .019467
        2018  |  -.1507585   .0262391    -5.75   0.000    -.2022021   -.0993148
              |
    cntct_tot |
contact wi..  |  -.1035922   .0219318    -4.72   0.000    -.1465986   -.0605859
              |
      vigdrug |
        Drug  |   .8975192   .0377297    23.79   0.000     .8235472    .9714912
              |
       vigalc |
     Alcohol  |    .665408   .0322037    20.66   0.000     .6022702    .7285458
              |
     vigschiz |
Schizophre~a  |   .5617166   .0352488    15.94   0.000     .4926084    .6308249
              |
       vigdep |
  Depression  |   .1975104   .0330222     5.98   0.000     .1327678    .2622531
          age |   .0030549   .0006078     5.03   0.000     .0018633    .0042465
              |
       female |
      female  |  -.0126313   .0208856    -0.60   0.545     -.053579    .0283165
              |
         race |
       black  |   .0302758   .0306792     0.99   0.324    -.0298731    .0904247
  other race  |  -.0159151   .0387147    -0.41   0.681    -.0918182    .0599879
              |
       region |
middle atl..  |   .0918989   .0564783     1.63   0.104    -.0188311    .2026289
e. nor. ce..  |   .0249153   .0540324     0.46   0.645    -.0810193    .1308499
w. nor. ce..  |  -.0555629   .0634146    -0.88   0.381    -.1798919    .0687661
south atla..  |   .0030138   .0533789     0.06   0.955    -.1016395    .1076671
e. sou. ce..  |  -.0196407   .0626963    -0.31   0.754    -.1425614      .10328
w. sou. ce..  |   .0752603   .0577248     1.30   0.192    -.0379135    .1884341
    mountain  |  -.0493819    .061304    -0.81   0.421    -.1695729    .0708091
     pacific  |  -.0047624   .0553516    -0.09   0.931    -.1132834    .1037585
              |
        metro |
   MetroArea  |   .0540215   .0258263     2.09   0.037     .0033871    .1046558
       coninc |   .0007372   .0003033     2.43   0.015     .0001421    .0013324
              |
       degree |
 high school  |  -.0300193   .0330277    -0.91   0.363    -.0947726     .034734
junior col..  |  -.1071244   .0472018    -2.27   0.023    -.1996672   -.0145815
    bachelor  |  -.0613265   .0403706    -1.52   0.129    -.1404771    .0178241
    graduate  |  -.0894489    .047135    -1.90   0.058    -.1818617     .002964
              |
        _cons |   1.931109   .0713028    27.08   0.000     1.791314    2.070904
-------------------------------------------------------------------------------

. how_many_imputations
Fraction of missing information (95% CI):  0.11 (0.06, 0.19)
Imputations in pilot:                      20
Imputations needed:                        9
Imputations to add:                        0

. 
. * Set sample weights *
. mi svyset sampcode [pw = wtssnr]

Sampling weights: wtssnr
             VCE: linearized
     Single unit: missing
        Strata 1: <one>
 Sampling unit 1: sampcode
           FPC 1: <zero>

.         
. ** Label and save data **
. compress
  variable cond was float now byte
  variable cond06 was float now byte
  variable cond18 was float now byte
  variable cond96 was float now byte
  variable vig_female was float now byte
  variable vig_gths was float now byte
  variable vig_white was float now byte
  variable vig_y06 was float now byte
  variable vig_y18 was float now byte
  variable vig_y96 was float now byte
  variable a_breakdwnR was float now byte
  variable a_breakdwnRV was float now byte
  variable a_charactrR was float now byte
  variable a_charactrRV was float now byte
  variable a_geneticsR was float now byte
  variable a_geneticsRV was float now byte
  variable a_godswillR was float now byte
  variable a_godswillRV was float now byte
  variable a_imbalnceR was float now byte
  variable a_imbalnceRV was float now byte
  variable a_physillR was float now byte
  variable a_physillRV was float now byte
  variable a_stressesR was float now byte
  variable a_stressesRV was float now byte
  variable a_upsdownsR was float now byte
  variable a_upsdownsRV was float now byte
  variable a_wayraiseR was float now byte
  variable a_wayraiseRV was float now byte
  variable anychild was float now byte
  variable cntct_any06 was float now byte
  variable cntct_any18 was float now byte
  variable cntct_any96 was float now byte
  variable cntct_oth06 was float now byte
  variable cntct_oth18 was float now byte
  variable cntct_oth96 was float now byte
  variable cntct_slf06 was float now byte
  variable cntct_slf18 was float now byte
  variable cntct_slf96 was float now byte
  variable cntct_so06 was float now byte
  variable cntct_so18 was float now byte
  variable cntct_so3 was float now byte
  variable cntct_so4 was float now byte
  variable cntct_so96 was float now byte
  variable cntct_val3 was float now byte
  variable cntct_val4 was float now byte
  variable metro was float now byte
  variable numchild was float now byte
  variable region4 was float now byte
  variable shld_dangroth was float now byte
  variable shld_dangrothR was float now byte
  variable shld_dangrslf was float now byte
  variable shld_dangrslfR was float now byte
  variable shld_meddoc was float now byte
  variable shld_meddocR was float now byte
  variable shld_mentldoc was float now byte
  variable shld_mentldocR was float now byte
  variable shld_mentlhos was float now byte
  variable shld_mentlhosR was float now byte
  variable shld_otcmed was float now byte
  variable shld_otcmedR was float now byte
  variable shld_rxmed was float now byte
  variable shld_rxmedR was float now byte
  variable shld_selfhelp was float now byte
  variable shld_selfhelpR was float now byte
  variable violent_othR was float now byte
  variable violent_selfR was float now byte
  variable age10 was float now byte
  variable cohort10 was float now byte
  variable ed_gths was float now byte
  variable white was float now byte
  variable SD_miss was float now byte
  variable s_nextdoorDK0 was float now byte
  variable s_socialDK0 was float now byte
  variable s_friendsDK0 was float now byte
  variable s_workDK0 was float now byte
  variable s_marryDK0 was float now byte
  variable s_grphomeDK0 was float now byte
  variable s_nextdoorDK1 was float now byte
  variable s_socialDK1 was float now byte
  variable s_friendsDK1 was float now byte
  variable s_workDK1 was float now byte
  variable s_marryDK1 was float now byte
  variable s_grphomeDK1 was float now byte
  variable s_nextdoorDK2 was float now byte
  variable s_socialDK2 was float now byte
  variable s_friendsDK2 was float now byte
  variable s_workDK2 was float now byte
  variable s_marryDK2 was float now byte
  variable s_grphomeDK2 was float now byte
  variable s_nextdoorDK3 was float now byte
  variable s_socialDK3 was float now byte
  variable s_friendsDK3 was float now byte
  variable s_workDK3 was float now byte
  variable s_marryDK3 was float now byte
  variable s_grphomeDK3 was float now byte
  variable s_nextdoorDK4 was float now byte
  variable s_socialDK4 was float now byte
  variable s_friendsDK4 was float now byte
  variable s_workDK4 was float now byte
  variable s_marryDK4 was float now byte
  variable s_grphomeDK4 was float now byte
  variable socdist_tot was float now byte
  variable myprob_max was float now byte
  variable c_effect_any was float now byte
  variable c_effect_gtmaxavg was float now byte
  variable c_effect_gtavg was float now byte
  variable _1_a_imbalnceR was float now byte
  variable _2_a_imbalnceR was float now byte
  variable _3_a_imbalnceR was float now byte
  variable _4_a_imbalnceR was float now byte
  variable _5_a_imbalnceR was float now byte
  variable _6_a_imbalnceR was float now byte
  variable _7_a_imbalnceR was float now byte
  variable _8_a_imbalnceR was float now byte
  variable _9_a_imbalnceR was float now byte
  variable _10_a_imbalnceR was float now byte
  variable _11_a_imbalnceR was float now byte
  variable _12_a_imbalnceR was float now byte
  variable _13_a_imbalnceR was float now byte
  variable _14_a_imbalnceR was float now byte
  variable _15_a_imbalnceR was float now byte
  variable _16_a_imbalnceR was float now byte
  variable _17_a_imbalnceR was float now byte
  variable _18_a_imbalnceR was float now byte
  variable _19_a_imbalnceR was float now byte
  variable _20_a_imbalnceR was float now byte
  variable formwt was double now byte
  variable oversamp was double now byte
  (1,536,640 bytes saved)

. label data "MLS - GSS Data | Matching Labeling Stigma | Multiple Imputation CE
>  | `tag'"
note: label truncated to 80 characters

. datasignature set, reset
  3920:431(74667):3808336677:1518812449       (data signature set)

. save     "Data/mls-data08-mice-contact_valence",  replace       
file Data/mls-data08-mice-contact_valence.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/bianca/Dropbox/_AcademicWork/Active/Research/-underReview/ML
> S_MatchingLabelingStigma/work_socius_2024_09_corrected/mls-data08-contact_vale
> nce.log
  log type:  text
 closed on:  26 Sep 2024, 17:06:03
--------------------------------------------------------------------------------
