--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/bianca/Dropbox/_AcademicWork/Active/Research/-underReview/ML
> S_MatchingLabelingStigma/work_socius_2024_09_other_imputed/mls-do04-contactBas
> eline.log
  log type:  text
 opened on:  26 Sep 2024, 10:50:16

.  
.  
. **********
. //#0 Setup      
. **********      
.  
.  version 17

.  set linesize 80

.  clear all

.  macro drop _all

.  set matsize 100, perm
(set matsize preference recorded)
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix
    sizes are now limited by edition of Stata.  See limits for more details.

. 
.  
.  local pgm   mls-do04-contactBaseline.do

.  local dte   2021-03-03

.  local who   bianca manago - trent mize

.  local tag   "`pgm'.do `who' `dte'"

.  
.  di "`tag'"
mls-do04-contactBaseline.do.do bianca manago - trent mize 2021-03-03

.  
. ****************************************************************
. //#1 Load Data
. **************************************************************** 
.  
. use "Data/mls-data07-mice-cont", clear  
(MLS - GSS Data | Matching Labeling Stigma | Multiple Imputation CE | mls-data07
> -)

.         
. ****************************************************************
. //#4 Baseline effects of different forms of contact
. ****************************************************************
. 
. // Table 3: Effects of Contact on Rates of Labeling //  
. 
. mi est, post:   logit L_mentlillB i.cntct_tot 

Multiple-imputation estimates                   Imputations       =         20
Logistic regression                             Number of obs     =      3,920
                                                Average RVI       =     0.0590
                                                Largest FMI       =     0.0876
DF adjustment:   Large sample                   DF:     min       =   2,515.30
                                                        avg       =   2,960.32
                                                        max       =   3,405.35
Model F test:       Equal FMI                   F(   1, 2515.3)   =      32.75
Within VCE type:          OIM                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
  L_mentlillB | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_tot |
contact wi..  |   .3937634   .0688092     5.72   0.000     .2588348    .5286919
        _cons |   .1659814   .0508037     3.27   0.001     .0663727    .2655902
-------------------------------------------------------------------------------

. est store c_tot

. mimrgns,        dydx(cntct_tot) predict(pr)

Multiple-imputation estimates                   Imputations       =         20
Conditional marginal effects                    Number of obs     =      3,920
                                                Average RVI       =     0.0964
                                                Largest FMI       =     0.0886
DF adjustment:   Large sample                   DF:     min       =   2,458.97
                                                        avg       =   2,458.97
Within VCE type: Delta-method                           max       =   2,458.97

Expression   : Pr(L_mentlillB), predict(pr)
dy/dx w.r.t. : 1.cntct_tot

-------------------------------------------------------------------------------
              |      dy/dx   Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_tot |
contact wi..  |   .0949929   .0165828     5.73   0.000     .0624752    .1275105
-------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.


. 
. mi est, post:   logit L_mentlillB i.cntct_tot i.year  ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree

Multiple-imputation estimates                   Imputations       =         20
Logistic regression                             Number of obs     =      3,920
                                                Average RVI       =     0.0451
                                                Largest FMI       =     0.1237
DF adjustment:   Large sample                   DF:     min       =   1,270.10
                                                        avg       =  21,963.08
                                                        max       = 144,106.70
Model F test:       Equal FMI                   F(  25,243427.2)  =      27.66
Within VCE type:          OIM                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
  L_mentlillB | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_tot |
contact wi..  |   .4344167   .0813623     5.34   0.000     .2748502    .5939832
              |
         year |
        2006  |   .1523538   .0973269     1.57   0.118    -.0384515    .3431591
        2018  |   .3365582   .0967227     3.48   0.001     .1469614     .526155
              |
      vigdrug |
        Drug  |   .7607258   .1281738     5.94   0.000     .5095033    1.011948
              |
       vigalc |
     Alcohol  |   1.294167   .1072446    12.07   0.000      1.08397    1.504364
              |
     vigschiz |
Schizophre~a  |   3.448285   .1504851    22.91   0.000     3.153314    3.743256
              |
       vigdep |
  Depression  |   2.052325   .1129245    18.17   0.000      1.83098     2.27367
          age |   .0011337   .0022248     0.51   0.610     -.003227    .0054944
              |
       female |
      female  |   .0989361    .076632     1.29   0.197    -.0512633    .2491355
              |
         race |
       black  |   .3976707   .1139525     3.49   0.000     .1743094     .621032
  other race  |  -.0804458   .1433624    -0.56   0.575    -.3614643    .2005726
              |
       region |
middle atl..  |   .0101927   .2139038     0.05   0.962    -.4091362    .4295216
e. nor. ce..  |   .0312975   .2021774     0.15   0.877    -.3649848    .4275799
w. nor. ce..  |   .0300413   .2363488     0.13   0.899    -.4332148    .4932975
south atla..  |  -.0801256   .2004699    -0.40   0.689    -.4730776    .3128265
e. sou. ce..  |  -.2254367   .2342482    -0.96   0.336    -.6846207    .2337473
w. sou. ce..  |  -.1299203   .2151051    -0.60   0.546    -.5515418    .2917012
    mountain  |   .1038189   .2302659     0.45   0.652    -.3475338    .5551716
     pacific  |  -.0162867   .2084503    -0.08   0.938    -.4248895    .3923161
              |
        metro |
   MetroArea  |  -.1870365   .0949041    -1.97   0.049    -.3730548   -.0010182
       coninc |   .0007208   .0011064     0.65   0.515    -.0014496    .0028913
              |
       degree |
 high school  |   -.134734   .1225007    -1.10   0.271    -.3748561     .105388
junior col..  |  -.1749963   .1738967    -1.01   0.314    -.5158497    .1658571
    bachelor  |  -.2512163   .1492064    -1.68   0.092    -.5437065     .041274
    graduate  |  -.1244119   .1730087    -0.72   0.472    -.4635253    .2147015
              |
        _cons |   -1.43061   .2654243    -5.39   0.000    -1.950866   -.9103538
-------------------------------------------------------------------------------

. mimrgns,        dydx(cntct_tot) predict(pr)

Multiple-imputation estimates                   Imputations       =         20
Average marginal effects                        Number of obs     =      3,920
                                                Average RVI       =     0.1108
                                                Largest FMI       =     0.1007
DF adjustment:   Large sample                   DF:     min       =   1,908.99
                                                        avg       =   1,908.99
Within VCE type: Delta-method                           max       =   1,908.99

Expression   : Pr(L_mentlillB), predict(pr)
dy/dx w.r.t. : 1.cntct_tot

-------------------------------------------------------------------------------
              |      dy/dx   Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_tot |
contact wi..  |    .080768   .0150952     5.35   0.000     .0511632    .1103727
-------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.


. 
. 
. *self vs other contact
. mi est, post:   logit L_mentlillB i.cntct_so4

Multiple-imputation estimates                   Imputations       =         20
Logistic regression                             Number of obs     =      3,920
                                                Average RVI       =     0.0719
                                                Largest FMI       =     0.0915
DF adjustment:   Large sample                   DF:     min       =   2,311.03
                                                        avg       =   3,647.68
                                                        max       =   5,641.37
Model F test:       Equal FMI                   F(   3, 7725.2)   =      15.38
Within VCE type:          OIM                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
  L_mentlillB | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_so4 |
Other Cont..  |   .3415914   .0710883     4.81   0.000     .2021979     .480985
Self Contact  |    .085559   .3085749     0.28   0.782    -.5194215    .6905395
        Both  |   .8690856   .1505505     5.77   0.000     .5738573    1.164314
              |
        _cons |   .1635348   .0503724     3.25   0.001     .0647855    .2622842
-------------------------------------------------------------------------------

. est store c_so

. mimrgns         cntct_so4, predict(pr)

Multiple-imputation estimates                   Imputations       =         20
Adjusted predictions                            Number of obs     =      3,920
                                                Average RVI       =     0.0713
                                                Largest FMI       =     0.0802
DF adjustment:   Large sample                   DF:     min       =   3,002.79
                                                        avg       =   4,532.43
Within VCE type: Delta-method                           max       =   5,663.76

Expression   : Pr(L_mentlillB), predict(pr)

-------------------------------------------------------------------------------
              |     Margin   Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_so4 |
  No Contact  |   .5407915   .0125089    43.23   0.000     .5162692    .5653137
Other Cont..  |   .6236597   .0114381    54.52   0.000     .6012366    .6460827
Self Contact  |   .5618548   .0748733     7.50   0.000     .4150594    .7086503
        Both  |   .7373567   .0272347    27.07   0.000     .6839561    .7907572
-------------------------------------------------------------------------------

. mimrgns         cntct_so4, predict(pr) pwcompare(pve)

Multiple-imputation estimates                   Imputations       =         20
Pairwise comparisons of adjusted predictions    Number of obs     =      3,920
                                                Average RVI       =     0.0713
                                                Largest FMI       =     0.0802
DF adjustment:   Large sample                   DF:     min       =   3,002.79
                                                        avg       =   4,532.43
Within VCE type: Delta-method                           max       =   5,663.76

Expression   : Pr(L_mentlillB), predict(pr)

-----------------------------------------------------------------------
                               |   Contrast   Std. err.      t    P>|t|
-------------------------------+---------------------------------------
                     cntct_so4 |
  Other Contact vs No Contact  |   .0828682   .0171918     4.82   0.000
   Self Contact vs No Contact  |   .0210634   .0758512     0.28   0.781
           Both vs No Contact  |   .1965652   .0302083     6.51   0.000
Self Contact vs Other Contact  |  -.0618048   .0759165    -0.81   0.416
        Both vs Other Contact  |    .113697    .029486     3.86   0.000
         Both vs Self Contact  |   .1755018   .0802605     2.19   0.029
-----------------------------------------------------------------------

. 
. mi est, post:   logit L_mentlillB i.cntct_so4 i.year  ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree 

Multiple-imputation estimates                   Imputations       =         20
Logistic regression                             Number of obs     =      3,920
                                                Average RVI       =     0.0482
                                                Largest FMI       =     0.1247
DF adjustment:   Large sample                   DF:     min       =   1,249.67
                                                        avg       =  19,666.25
                                                        max       = 108,550.40
Model F test:       Equal FMI                   F(  27,233758.1)  =      25.94
Within VCE type:          OIM                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
  L_mentlillB | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_so4 |
Other Cont..  |   .3563647   .0851846     4.18   0.000     .1892856    .5234439
Self Contact  |   .0084939    .366086     0.02   0.981    -.7093281    .7263159
        Both  |   1.041506    .169662     6.14   0.000     .7088446    1.374168
              |
         year |
        2006  |   .2094549   .0987681     2.12   0.034     .0158247     .403085
        2018  |   .2985662   .0975252     3.06   0.002     .1074017    .4897307
              |
      vigdrug |
        Drug  |    .762207   .1288856     5.91   0.000     .5095889    1.014825
              |
       vigalc |
     Alcohol  |   1.284651   .1076808    11.93   0.000     1.073598    1.495703
              |
     vigschiz |
Schizophre~a  |   3.457586   .1507908    22.93   0.000     3.162015    3.753156
              |
       vigdep |
  Depression  |   2.055605   .1130647    18.18   0.000     1.833988    2.277222
          age |   .0016763   .0022371     0.75   0.454    -.0027085    .0060612
              |
       female |
      female  |   .0820328   .0768931     1.07   0.286    -.0686777    .2327434
              |
         race |
       black  |   .4211717   .1141964     3.69   0.000     .1973366    .6450068
  other race  |  -.0627846   .1436705    -0.44   0.662    -.3444015    .2188323
              |
       region |
middle atl..  |   .0301219   .2144581     0.14   0.888    -.3902833    .4505271
e. nor. ce..  |    .052204   .2032423     0.26   0.797     -.346166     .450574
w. nor. ce..  |   .0300157    .237616     0.13   0.899    -.4357282    .4957596
south atla..  |   -.077695   .2013637    -0.39   0.700    -.4723968    .3170069
e. sou. ce..  |  -.2152188   .2350251    -0.92   0.360    -.6759198    .2454823
w. sou. ce..  |  -.1175519   .2156604    -0.55   0.586    -.5402552    .3051514
    mountain  |   .0986433   .2312596     0.43   0.670    -.3546558    .5519423
     pacific  |  -.0221089   .2090226    -0.11   0.916    -.4318248     .387607
              |
        metro |
   MetroArea  |  -.1986852   .0957632    -2.07   0.038    -.3863924   -.0109779
       coninc |   .0008709   .0011111     0.78   0.433     -.001309    .0030508
              |
       degree |
 high school  |  -.1326881   .1231488    -1.08   0.281    -.3740843     .108708
junior col..  |  -.1835167   .1744207    -1.05   0.293    -.5253978    .1583644
    bachelor  |  -.2485698   .1502457    -1.65   0.098    -.5431094    .0459698
    graduate  |  -.1270219   .1742784    -0.73   0.466    -.4686336    .2145898
              |
        _cons |  -1.472048   .2669621    -5.51   0.000     -1.99532   -.9487767
-------------------------------------------------------------------------------

. 
. mimrgns         cntct_so4, predict(pr)

Multiple-imputation estimates                   Imputations       =         20
Predictive margins                              Number of obs     =      3,920
                                                Average RVI       =     0.0798
                                                Largest FMI       =     0.0866
DF adjustment:   Large sample                   DF:     min       =   2,576.12
                                                        avg       =   3,569.34
Within VCE type: Delta-method                           max       =   4,735.06

Expression   : Pr(L_mentlillB), predict(pr)

-------------------------------------------------------------------------------
              |     Margin   Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_so4 |
  No Contact  |   .5499042   .0111647    49.25   0.000     .5280134    .5717951
Other Cont..  |   .6162921   .0104882    58.76   0.000      .595729    .6368552
Self Contact  |    .551443   .0681299     8.09   0.000     .4178482    .6850378
        Both  |   .7346298   .0250064    29.38   0.000     .6856056     .783654
-------------------------------------------------------------------------------

. mimrgns         cntct_so4, predict(pr) pwcompare(pve)

Multiple-imputation estimates                   Imputations       =         20
Pairwise comparisons of predictive margins      Number of obs     =      3,920
                                                Average RVI       =     0.0798
                                                Largest FMI       =     0.0866
DF adjustment:   Large sample                   DF:     min       =   2,576.12
                                                        avg       =   3,569.34
Within VCE type: Delta-method                           max       =   4,735.06

Expression   : Pr(L_mentlillB), predict(pr)

-----------------------------------------------------------------------
                               |   Contrast   Std. err.      t    P>|t|
-------------------------------+---------------------------------------
                     cntct_so4 |
  Other Contact vs No Contact  |   .0663879   .0158325     4.19   0.000
   Self Contact vs No Contact  |   .0015387   .0687942     0.02   0.982
           Both vs No Contact  |   .1847255   .0276382     6.68   0.000
Self Contact vs Other Contact  |  -.0648491   .0694737    -0.93   0.351
        Both vs Other Contact  |   .1183377   .0272335     4.35   0.000
         Both vs Self Contact  |   .1831868    .072617     2.52   0.012
-----------------------------------------------------------------------

. 
. 
. *valence of contact
. mi est, post:   logit L_mentlillB i.cntct_val4

Multiple-imputation estimates                   Imputations       =         20
Logistic regression                             Number of obs     =      3,920
                                                Average RVI       =     0.0675
                                                Largest FMI       =     0.1034
DF adjustment:   Large sample                   DF:     min       =   1,810.41
                                                        avg       =   5,011.60
                                                        max       =   6,622.96
Model F test:       Equal FMI                   F(   3, 8641.6)   =      11.75
Within VCE type:          OIM                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
  L_mentlillB | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
   cntct_val4 |
 Any Contact  |   .3737357   .0795919     4.70   0.000     .2176341    .5298373
 Bad Contact  |   .5039969    .110668     4.55   0.000     .2870519    .7209419
Good Contact  |   .3565865   .1125659     3.17   0.002     .1359203    .5772526
              |
        _cons |   .1636343   .0504153     3.25   0.001     .0647988    .2624698
-------------------------------------------------------------------------------

. est store c_val

. mimrgns         cntct_val4, predict(pr)

Multiple-imputation estimates                   Imputations       =         20
Adjusted predictions                            Number of obs     =      3,920
                                                Average RVI       =     0.0674
                                                Largest FMI       =     0.0785
DF adjustment:   Large sample                   DF:     min       =   3,129.35
                                                        avg       =   5,040.72
Within VCE type: Delta-method                           max       =   6,550.10

Expression   : Pr(L_mentlillB), predict(pr)

-------------------------------------------------------------------------------
              |     Margin   Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
   cntct_val4 |
  No Contact  |   .5408161   .0125194    43.20   0.000     .5162727    .5653595
 Any Contact  |   .6311927   .0139236    45.33   0.000     .6038923    .6584931
 Bad Contact  |   .6609535   .0221662    29.82   0.000     .6174988    .7044082
Good Contact  |   .6271846   .0235488    26.63   0.000     .5810213    .6733478
-------------------------------------------------------------------------------

. mimrgns         cntct_val4, predict(pr) pwcompare(pve)

Multiple-imputation estimates                   Imputations       =         20
Pairwise comparisons of adjusted predictions    Number of obs     =      3,920
                                                Average RVI       =     0.0674
                                                Largest FMI       =     0.0785
DF adjustment:   Large sample                   DF:     min       =   3,129.35
                                                        avg       =   5,040.72
Within VCE type: Delta-method                           max       =   6,550.10

Expression   : Pr(L_mentlillB), predict(pr)

---------------------------------------------------------------------
                             |   Contrast   Std. err.      t    P>|t|
-----------------------------+---------------------------------------
                  cntct_val4 |
  Any Contact vs No Contact  |   .0903766   .0190537     4.74   0.000
  Bad Contact vs No Contact  |   .1201374   .0253677     4.74   0.000
 Good Contact vs No Contact  |   .0863685     .02665     3.24   0.001
 Bad Contact vs Any Contact  |   .0297608   .0266354     1.12   0.264
Good Contact vs Any Contact  |  -.0040081   .0274908    -0.15   0.884
Good Contact vs Bad Contact  |  -.0337689   .0324107    -1.04   0.298
---------------------------------------------------------------------

. 
. mi est, post:   logit L_mentlillB i.cntct_val4  ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree 

Multiple-imputation estimates                   Imputations       =         20
Logistic regression                             Number of obs     =      3,920
                                                Average RVI       =     0.0489
                                                Largest FMI       =     0.1281
DF adjustment:   Large sample                   DF:     min       =   1,184.26
                                                        avg       =  20,836.07
                                                        max       =  78,786.68
Model F test:       Equal FMI                   F(  25,208776.5)  =      27.39
Within VCE type:          OIM                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
  L_mentlillB | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
   cntct_val4 |
 Any Contact  |   .4670562   .0921809     5.07   0.000     .2862483    .6478641
 Bad Contact  |   .5294335   .1313945     4.03   0.000     .2717815    .7870855
Good Contact  |   .3003138   .1349971     2.22   0.026     .0356097    .5650178
              |
      vigdrug |
        Drug  |   .7451761   .1260719     5.91   0.000       .49807    .9922822
              |
       vigalc |
     Alcohol  |   1.288629   .1073833    12.00   0.000     1.078158    1.499099
              |
     vigschiz |
Schizophre~a  |   3.435159    .150692    22.80   0.000     3.139773    3.730546
              |
       vigdep |
  Depression  |   2.047563   .1127092    18.17   0.000     1.826641    2.268485
          age |   .0020702   .0021971     0.94   0.346    -.0022361    .0063765
              |
       female |
      female  |   .0813925   .0764774     1.06   0.287    -.0685029    .2312879
              |
         race |
       black  |   .4262832   .1137027     3.75   0.000     .2034139    .6491526
  other race  |  -.0236549   .1421543    -0.17   0.868    -.3023031    .2549932
              |
       region |
middle atl..  |   .0104778   .2125359     0.05   0.961     -.406157    .4271127
e. nor. ce..  |   .0543162   .2012314     0.27   0.787    -.3401098    .4487423
w. nor. ce..  |   .0322544    .235433     0.14   0.891    -.4292028    .4937116
south atla..  |  -.0515923   .1989745    -0.26   0.795    -.4416039    .3384192
e. sou. ce..  |  -.2018458   .2333234    -0.87   0.387    -.6592106    .2555189
w. sou. ce..  |   -.090112   .2139288    -0.42   0.674    -.5094229    .3291988
    mountain  |   .1193444   .2292063     0.52   0.603    -.3299279    .5686167
     pacific  |  -.0044163   .2071978    -0.02   0.983    -.4105558    .4017231
              |
        metro |
   MetroArea  |  -.1886726   .0948832    -1.99   0.047    -.3746531   -.0026922
       coninc |   .0007667   .0011072     0.69   0.489    -.0014055    .0029389
              |
       degree |
 high school  |  -.1004531   .1222716    -0.82   0.411    -.3401313     .139225
junior col..  |  -.1146087   .1727357    -0.66   0.507    -.4531851    .2239677
    bachelor  |  -.1995422   .1487698    -1.34   0.180    -.4911832    .0920987
    graduate  |  -.0604365   .1722698    -0.35   0.726    -.3981027    .2772296
              |
        _cons |  -1.383458   .2630059    -5.26   0.000    -1.898967   -.8679491
-------------------------------------------------------------------------------

. 
. mimrgns         cntct_val4, predict(pr)

Multiple-imputation estimates                   Imputations       =         20
Predictive margins                              Number of obs     =      3,920
                                                Average RVI       =     0.0880
                                                Largest FMI       =     0.0893
DF adjustment:   Large sample                   DF:     min       =   2,420.57
                                                        avg       =   2,917.42
Within VCE type: Delta-method                           max       =   3,683.29

Expression   : Pr(L_mentlillB), predict(pr)

-------------------------------------------------------------------------------
              |     Margin   Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
   cntct_val4 |
  No Contact  |   .5481821   .0111193    49.30   0.000     .5263814    .5699827
 Any Contact  |   .6352273   .0123946    51.25   0.000     .6109235    .6595311
 Bad Contact  |    .646498   .0209287    30.89   0.000      .605458     .687538
Good Contact  |    .604574   .0223695    27.03   0.000     .5607117    .6484362
-------------------------------------------------------------------------------

. mimrgns         cntct_val4, predict(pr) pwcompare(pve)

Multiple-imputation estimates                   Imputations       =         20
Pairwise comparisons of predictive margins      Number of obs     =      3,920
                                                Average RVI       =     0.0880
                                                Largest FMI       =     0.0893
DF adjustment:   Large sample                   DF:     min       =   2,420.57
                                                        avg       =   2,917.42
Within VCE type: Delta-method                           max       =   3,683.29

Expression   : Pr(L_mentlillB), predict(pr)

---------------------------------------------------------------------
                             |   Contrast   Std. err.      t    P>|t|
-----------------------------+---------------------------------------
                  cntct_val4 |
  Any Contact vs No Contact  |   .0870452   .0170113     5.12   0.000
  Bad Contact vs No Contact  |   .0983159   .0238898     4.12   0.000
 Good Contact vs No Contact  |   .0563919   .0251681     2.24   0.025
 Bad Contact vs Any Contact  |   .0112707   .0248661     0.45   0.650
Good Contact vs Any Contact  |  -.0306533   .0259625    -1.18   0.238
Good Contact vs Bad Contact  |   -.041924    .030225    -1.39   0.166
---------------------------------------------------------------------

. 
. 
. *Coefs (note Table A3 shows the MEs from above)
. esttab c_tot c_so c_val, b(3) se(3) label ///
>                 keep(1.cntct_tot 1.cntct_so4 2.cntct_so4 3.cntct_so4 ///
>                          1.cntct_val4 2.cntct_val4 3.cntct_val4) ///
>                 star(+ 0.10 * 0.05 ** 0.01 *** 0.001) 

--------------------------------------------------------------------
                              (1)             (2)             (3)   
                     Very Likel~s    Very Likel~s    Very Likel~s   
--------------------------------------------------------------------
Very Likely/Likely~s                                                
contact with menta~s        0.394***                                
                          (0.069)                                   

Other Contact                               0.342***                
                                          (0.071)                   

Self Contact                                0.086                   
                                          (0.309)                   

Both                                        0.869***                
                                          (0.151)                   

Any Contact                                                 0.374***
                                                          (0.080)   

Bad Contact                                                 0.504***
                                                          (0.111)   

Good Contact                                                0.357** 
                                                          (0.113)   
--------------------------------------------------------------------
Observations                 3920            3920            3920   
--------------------------------------------------------------------
Standard errors in parentheses
+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

.                 
. esttab c_tot c_so c_val using "Tables/mls-do04-labeling_by_contact_2024-09-26.
> rtf", replace ///
>                 b(3) se(3) label ///
>                 keep(1.cntct_tot 1.cntct_so4 2.cntct_so4 3.cntct_so4 ///
>                          1.cntct_val4 2.cntct_val4 3.cntct_val4) ///
>                 star(+ 0.10 * 0.05 ** 0.01 *** 0.001) ///
>                 title("Table 3: Effects of contact on labeling")
(file Tables/mls-do04-labeling_by_contact_2024-09-26.rtf not found)
(output written to Tables/mls-do04-labeling_by_contact_2024-09-26.rtf)

. 
. 
. // Table 4: Effects on Stigma //
. 
. *binary any contact
. mi est: reg socdistSS   i.cntct_tot

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0091
                                                Largest FMI       =     0.0175
                                                Complete DF       =       3918
DF adjustment:   Small sample                   DF:     min       =   3,623.21
                                                        avg       =   3,721.94
                                                        max       =   3,820.67
Model F test:       Equal FMI                   F(   1, 3623.2)   =      31.78
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_tot |
contact wi..  |  -.1315534   .0233345    -5.64   0.000    -.1773035   -.0858034
        _cons |   2.518994   .0175363   143.64   0.000     2.484613    2.553376
-------------------------------------------------------------------------------

.                 
. mi est, post: reg socdistSS     i.cntct_tot i.L_mentlillB i.year  ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree            

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0064
                                                Largest FMI       =     0.0954
                                                Complete DF       =       3893
DF adjustment:   Small sample                   DF:     min       =   1,325.62
                                                        avg       =   3,740.32
                                                        max       =   3,888.70
Model F test:       Equal FMI                   F(  26, 3889.6)   =      40.48
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_tot |
contact wi..  |  -.1017695   .0215944    -4.71   0.000    -.1441082   -.0594307
              |
  L_mentlillB |
Lab MntlIl..  |   .0701458   .0241675     2.90   0.004     .0227605    .1175311
              |
         year |
        2006  |  -.0313427   .0256678    -1.22   0.222    -.0816662    .0189809
        2018  |  -.1508203   .0262395    -5.75   0.000    -.2022647   -.0993758
              |
      vigdrug |
        Drug  |   .8973905   .0377372    23.78   0.000     .8234038    .9713772
              |
       vigalc |
     Alcohol  |   .6650258   .0322102    20.65   0.000     .6018752    .7281765
              |
     vigschiz |
Schizophre~a  |   .5609937   .0352256    15.93   0.000     .4919308    .6300566
              |
       vigdep |
  Depression  |    .196796   .0330375     5.96   0.000     .1320232    .2615687
          age |   .0030538   .0006079     5.02   0.000     .0018619    .0042457
              |
       female |
      female  |  -.0126567   .0208689    -0.61   0.544    -.0535717    .0282584
              |
         race |
       black  |   .0307431   .0306761     1.00   0.316    -.0293998     .090886
  other race  |  -.0152055   .0387223    -0.39   0.695    -.0911234    .0607124
              |
       region |
middle atl..  |    .091994   .0564768     1.63   0.103    -.0187329    .2027209
e. nor. ce..  |   .0254792    .054043     0.47   0.637    -.0804761    .1314345
w. nor. ce..  |   -.055127   .0634104    -0.87   0.385    -.1794478    .0691938
south atla..  |   .0034318   .0533887     0.06   0.949    -.1012407    .1081043
e. sou. ce..  |  -.0187079   .0627098    -0.30   0.765    -.1416552    .1042394
w. sou. ce..  |   .0760051   .0577353     1.32   0.188    -.0371892    .1891994
    mountain  |  -.0486405   .0613183    -0.79   0.428    -.1688596    .0715785
     pacific  |  -.0048603   .0553504    -0.09   0.930    -.1133789    .1036582
              |
        metro |
   MetroArea  |   .0547731   .0258243     2.12   0.034     .0041426    .1054036
       coninc |   .0007736   .0003007     2.57   0.010     .0001836    .0013636
              |
       degree |
 high school  |  -.0307639   .0330056    -0.93   0.351     -.095474    .0339461
junior col..  |  -.1079268   .0471421    -2.29   0.022    -.2003525   -.0155011
    bachelor  |  -.0633269   .0402731    -1.57   0.116    -.1422857    .0156319
    graduate  |  -.0915051   .0470511    -1.94   0.052     -.183753    .0007429
              |
        _cons |   1.928671   .0713149    27.04   0.000     1.788853     2.06849
-------------------------------------------------------------------------------

. est store sc_tot

.         
. *separate out self vs other contact     
. mi est (diff: _b[1.cntct_so4] - _b[2.cntct_so4]): ///
>                 reg socdistSS i.cntct_so4 i.year

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0290
                                                Largest FMI       =     0.0586
                                                Complete DF       =       3914
DF adjustment:   Small sample                   DF:     min       =   2,222.17
                                                        avg       =   3,113.05
                                                        max       =   3,905.61
Model F test:       Equal FMI                   F(   5, 3723.7)   =      13.45
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_so4 |
Other Cont..  |   -.103918   .0249408    -4.17   0.000    -.1528262   -.0550099
Self Contact  |  -.2812922   .1089952    -2.58   0.010    -.4950352   -.0675491
        Both  |  -.1734362   .0478488    -3.62   0.000    -.2672619   -.0796106
              |
         year |
        2006  |  -.1487226   .0277481    -5.36   0.000     -.203125   -.0943203
        2018  |  -.1287365   .0287752    -4.47   0.000    -.1851524   -.0723206
              |
        _cons |   2.600259   .0225664   115.23   0.000     2.556015    2.644503
-------------------------------------------------------------------------------

Transformations                                 Average RVI       =     0.0545
                                                Largest FMI       =     0.0520
                                                Complete DF       =       3914
DF adjustment:   Small sample                   DF:     min       =   2,436.93
                                                        avg       =   2,436.93
Within VCE type:          OLS                           max       =   2,436.93

         diff: _b[1.cntct_so4] - _b[2.cntct_so4]

------------------------------------------------------------------------------
   socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        diff |   .1773741   .1088222     1.63   0.103    -.0360195    .3907678
------------------------------------------------------------------------------

. mi testtransform diff
note: assuming equal fractions of missing information.

         diff: _b[1.cntct_so4] - _b[2.cntct_so4]

 ( 1)  diff = 0

       F(  1,2436.9) =    2.66
            Prob > F =    0.1032

. 
. mi est (diff: _b[1.cntct_so4] - _b[2.cntct_so4]), post: ///
>                 reg socdistSS   i.cntct_so4 i.L_mentlillB i.year  ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree    

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0111
                                                Largest FMI       =     0.0957
                                                Complete DF       =       3891
DF adjustment:   Small sample                   DF:     min       =   1,321.40
                                                        avg       =   3,604.55
                                                        max       =   3,886.48
Model F test:       Equal FMI                   F(  28, 3885.3)   =      37.68
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    cntct_so4 |
Other Cont..  |  -.0868751   .0229717    -3.78   0.000    -.1319252   -.0418251
Self Contact  |  -.2857773   .0977515    -2.92   0.003    -.4774638   -.0940908
        Both  |  -.1600595   .0437259    -3.66   0.000    -.2457977   -.0743213
              |
  L_mentlillB |
Lab MntlIl..  |   .0718987   .0242484     2.97   0.003     .0243541    .1194434
              |
         year |
        2006  |  -.0412719     .02607    -1.58   0.113    -.0923841    .0098403
        2018  |  -.1436377   .0264258    -5.44   0.000    -.1954475    -.091828
              |
      vigdrug |
        Drug  |   .8974502   .0377092    23.80   0.000     .8235185     .971382
              |
       vigalc |
     Alcohol  |   .6661407   .0321927    20.69   0.000     .6030244     .729257
              |
     vigschiz |
Schizophre~a  |   .5610565   .0352285    15.93   0.000      .491988    .6301251
              |
       vigdep |
  Depression  |   .1962153   .0330127     5.94   0.000     .1314912    .2609395
          age |   .0029896   .0006088     4.91   0.000     .0017961    .0041832
              |
       female |
      female  |  -.0114581   .0208833    -0.55   0.583    -.0524013    .0294852
              |
         race |
       black  |   .0291179   .0306895     0.95   0.343    -.0310512    .0892869
  other race  |  -.0181365   .0387268    -0.47   0.640    -.0940633    .0577902
              |
       region |
middle atl..  |   .0911122   .0564669     1.61   0.107    -.0195953    .2018198
e. nor. ce..  |   .0228979   .0540285     0.42   0.672    -.0830289    .1288248
w. nor. ce..  |  -.0551752   .0633852    -0.87   0.384    -.1794467    .0690962
south atla..  |   .0035583   .0533672     0.07   0.947     -.101072    .1081886
e. sou. ce..  |  -.0199505   .0626907    -0.32   0.750    -.1428603    .1029593
w. sou. ce..  |   .0735136   .0577042     1.27   0.203    -.0396198     .186647
    mountain  |  -.0508882   .0612871    -0.83   0.406    -.1710461    .0692697
     pacific  |  -.0062157   .0553218    -0.11   0.911    -.1146783    .1022469
              |
        metro |
   MetroArea  |   .0578585   .0258412     2.24   0.025     .0071949    .1085221
       coninc |   .0007306   .0003012     2.43   0.015     .0001397    .0013214
              |
       degree |
 high school  |  -.0316488   .0329886    -0.96   0.337    -.0963255    .0330278
junior col..  |   -.106499   .0471267    -2.26   0.024    -.1988946   -.0141035
    bachelor  |  -.0661861   .0402679    -1.64   0.100    -.1451348    .0127625
    graduate  |  -.0917095   .0470316    -1.95   0.051    -.1839192    .0005002
              |
        _cons |   1.934538   .0713589    27.11   0.000     1.794633    2.074442
-------------------------------------------------------------------------------

Transformations                                 Average RVI       =     0.0530
                                                Largest FMI       =     0.0506
                                                Complete DF       =       3891
DF adjustment:   Small sample                   DF:     min       =   2,473.57
                                                        avg       =   2,473.57
Within VCE type:          OLS                           max       =   2,473.57

         diff: _b[1.cntct_so4] - _b[2.cntct_so4]

------------------------------------------------------------------------------
   socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        diff |   .1989022   .0978866     2.03   0.042     .0069541    .3908502
------------------------------------------------------------------------------

. est store sc_so

. mi testtransform diff
note: assuming equal fractions of missing information.

         diff: _b[1.cntct_so4] - _b[2.cntct_so4]

 ( 1)  diff = 0

       F(  1,2473.6) =    4.13
            Prob > F =    0.0423

. 
. *separate out by valence of contact
. mi est (diff: _b[1.cntct_val4] - _b[2.cntct_val4]): ///
>                 reg socdistSS   i.cntct_val4 i.year

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0446
                                                Largest FMI       =     0.1163
                                                Complete DF       =       3914
DF adjustment:   Small sample                   DF:     min       =   1,014.95
                                                        avg       =   2,312.69
                                                        max       =   3,906.37
Model F test:       Equal FMI                   F(   5, 3507.2)   =      12.54
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
   cntct_val4 |
 Any Contact  |  -.1098417   .0293038    -3.75   0.000    -.1673062   -.0523771
 Bad Contact  |   -.136059   .0460949    -2.95   0.003    -.2264892   -.0456289
Good Contact  |  -.1361124   .0476475    -2.86   0.004    -.2296113   -.0426135
              |
         year |
        2006  |   -.123754   .0390231    -3.17   0.002    -.2002871    -.047221
        2018  |  -.1358248   .0286708    -4.74   0.000     -.192036   -.0796137
              |
        _cons |   2.595842   .0237461   109.32   0.000     2.549284      2.6424
-------------------------------------------------------------------------------

Transformations                                 Average RVI       =     0.1311
                                                Largest FMI       =     0.1172
                                                Complete DF       =       3914
DF adjustment:   Small sample                   DF:     min       =   1,003.42
                                                        avg       =   1,003.42
Within VCE type:          OLS                           max       =   1,003.42

         diff: _b[1.cntct_val4] - _b[2.cntct_val4]

------------------------------------------------------------------------------
   socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        diff |   .0262174     .05453     0.48   0.631    -.0807884    .1332232
------------------------------------------------------------------------------

. mi testtransform diff
note: assuming equal fractions of missing information.

         diff: _b[1.cntct_val4] - _b[2.cntct_val4]

 ( 1)  diff = 0

       F(  1,1003.4) =    0.23
            Prob > F =    0.6308

.         
. mi est (diff: _b[1.cntct_val4] - _b[2.cntct_val4]), post: ///
>                 reg socdistSS   i.cntct_val4 i.L_mentlillB i.year  ///
>                                                 i.vigdrug i.vigalc i.vigschiz 
> i.vigdep ///
>                                                 age i.female i.race i.region i
> .metro coninc i.degree    

Multiple-imputation estimates                   Imputations       =         20
Linear regression                               Number of obs     =      3,920
                                                Average RVI       =     0.0137
                                                Largest FMI       =     0.1180
                                                Complete DF       =       3891
DF adjustment:   Small sample                   DF:     min       =     993.03
                                                        avg       =   3,475.38
                                                        max       =   3,887.24
Model F test:       Equal FMI                   F(  28, 3883.3)   =      37.34
Within VCE type:          OLS                   Prob > F          =     0.0000

-------------------------------------------------------------------------------
    socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
   cntct_val4 |
 Any Contact  |  -.0956386    .026595    -3.60   0.000    -.1477881   -.0434891
 Bad Contact  |  -.1259599   .0415854    -3.03   0.002    -.2075301   -.0443896
Good Contact  |  -.1086949   .0432546    -2.51   0.012    -.1935757    -.023814
              |
  L_mentlillB |
Lab MntlIl..  |   .0704501    .024148     2.92   0.004     .0231033    .1177969
              |
         year |
        2006  |  -.0184928   .0359597    -0.51   0.607    -.0890152    .0520296
        2018  |  -.1516005    .026309    -5.76   0.000    -.2031812   -.1000198
              |
      vigdrug |
        Drug  |   .8974137   .0377394    23.78   0.000     .8234228    .9714046
              |
       vigalc |
     Alcohol  |   .6652962   .0322345    20.64   0.000      .602098    .7284944
              |
     vigschiz |
Schizophre~a  |   .5607847   .0352216    15.92   0.000     .4917299    .6298395
              |
       vigdep |
  Depression  |   .1966776   .0330398     5.95   0.000     .1319003    .2614549
          age |   .0030582    .000608     5.03   0.000     .0018661    .0042503
              |
       female |
      female  |  -.0118869   .0208953    -0.57   0.569    -.0528538    .0290799
              |
         race |
       black  |   .0304094   .0307051     0.99   0.322    -.0297902    .0906091
  other race  |  -.0157862   .0387419    -0.41   0.684    -.0917427    .0601703
              |
       region |
middle atl..  |   .0914739   .0564797     1.62   0.105    -.0192586    .2022065
e. nor. ce..  |   .0254583   .0540519     0.47   0.638    -.0805146    .1314311
w. nor. ce..  |   -.055029   .0634182    -0.87   0.386    -.1793651    .0693072
south atla..  |   .0027768   .0533882     0.05   0.959    -.1018948    .1074484
e. sou. ce..  |  -.0189987    .062722    -0.30   0.762      -.14197    .1039725
w. sou. ce..  |   .0752447   .0577518     1.30   0.193    -.0379821    .1884714
    mountain  |  -.0483786   .0613211    -0.79   0.430    -.1686032     .071846
     pacific  |  -.0050847   .0553551    -0.09   0.927    -.1136126    .1034431
              |
        metro |
   MetroArea  |   .0548026   .0258307     2.12   0.034     .0041596    .1054456
       coninc |   .0007822   .0003004     2.60   0.009     .0001929    .0013715
              |
       degree |
 high school  |  -.0310721   .0330178    -0.94   0.347     -.095806    .0336619
junior col..  |  -.1086948    .047193    -2.30   0.021    -.2012205   -.0161692
    bachelor  |  -.0633002   .0403132    -1.57   0.116    -.1423378    .0157374
    graduate  |  -.0916566   .0470637    -1.95   0.052    -.1839291     .000616
              |
        _cons |   1.925487   .0716751    26.86   0.000     1.784962    2.066012
-------------------------------------------------------------------------------

Transformations                                 Average RVI       =     0.1230
                                                Largest FMI       =     0.1107
                                                Complete DF       =       3891
DF adjustment:   Small sample                   DF:     min       =   1,086.83
                                                        avg       =   1,086.83
Within VCE type:          OLS                           max       =   1,086.83

         diff: _b[1.cntct_val4] - _b[2.cntct_val4]

------------------------------------------------------------------------------
   socdistSS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        diff |   .0303213   .0488646     0.62   0.535    -.0655584    .1262009
------------------------------------------------------------------------------

. est store sc_val

. mi testtransform diff
note: assuming equal fractions of missing information.

         diff: _b[1.cntct_val4] - _b[2.cntct_val4]

 ( 1)  diff = 0

       F(  1,1086.8) =    0.39
            Prob > F =    0.5350

.         
. *Table A4       
. esttab sc_tot sc_so sc_val, b(3) se(3) ///
>                 keep(1.cntct_tot 1.cntct_so4 2.cntct_so4 3.cntct_so4 ///
>                          1.cntct_val4 2.cntct_val4 3.cntct_val4) ///
>                 star(+ 0.10 * 0.05 ** 0.01 *** 0.001)

------------------------------------------------------------
                      (1)             (2)             (3)   
                socdistSS       socdistSS       socdistSS   
------------------------------------------------------------
1.cntct_tot        -0.102***                                
                  (0.022)                                   

1.cntct_so4                        -0.087***                
                                  (0.023)                   

2.cntct_so4                        -0.286**                 
                                  (0.098)                   

3.cntct_so4                        -0.160***                
                                  (0.044)                   

1.cntct_val4                                       -0.096***
                                                  (0.027)   

2.cntct_val4                                       -0.126** 
                                                  (0.042)   

3.cntct_val4                                       -0.109*  
                                                  (0.043)   
------------------------------------------------------------
N                    3920            3920            3920   
------------------------------------------------------------
Standard errors in parentheses
+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

. esttab sc_tot sc_so sc_val using "Tables/mls-do04-stigma_by_contact_2024-09-26
> .rtf", replace ///
>                 b(3) se(3) label nogaps ///
>                 keep(1.cntct_tot 1.cntct_so4 2.cntct_so4 3.cntct_so4 ///
>                          1.cntct_val4 2.cntct_val4 3.cntct_val4) ///
>                 star(+ 0.10 * 0.05 ** 0.01 *** 0.001) ///
> title("Table 4: Effects of contact on stigma, with different measures of conta
> ct (N = 3,920)")
(file Tables/mls-do04-stigma_by_contact_2024-09-26.rtf not found)
(output written to Tables/mls-do04-stigma_by_contact_2024-09-26.rtf)

.                 
. 
. *****************       
.         log close
      name:  <unnamed>
       log:  /Users/bianca/Dropbox/_AcademicWork/Active/Research/-underReview/ML
> S_MatchingLabelingStigma/work_socius_2024_09_other_imputed/mls-do04-contactBas
> eline.log
  log type:  text
 closed on:  26 Sep 2024, 10:51:15
--------------------------------------------------------------------------------
